questions = [
        ('Сколько месяцев в году имеют 28 дней?', 'Все', 'Один', 'Ни одного', 'Два'),
        ('Каким станет зелёный утёс, если упадёт в Красное море?', 'Мокрым', 'Красным',
        'Не изменится', 'Фиолетовым'),
        ('Какой рукой лучше размешивать чай?', 'Ложкой', 'Правой', 'Левой', 'Любой'),
        ('Что не имеет длины, глубины, ширины, высоты, а можно измерить?', 'Время', 
        'Глупость', 'Море', 'Воздух'),
        ('Когда сетью можно вытянуть воду?', 'Когда вода замёрзла', 'Когда нет рыбы', 
        'Когда уплыла золотая рыбка', 'Когда сеть порвалась'),
        ('Что больше слона и ничего не весит?', 'Тень слона', 'Воздушный шар', 'Парашют', 'Облако')
    ]

quizes = [
        'Своя игра',
        'Кто хочет стать миллионером?',
        'Самый умный'
    ]
# [quiz_id, question_id]
conf_tabl = [[1, 1],  [1, 3], [1, 5], [1, 6],
             [2, 2], [2, 4],
             [3, 1], [3, 2], [3, 3], [3, 4], [3, 5], [3, 6]]