"""Вам необходимо написать функцию golden_ratio(i), которая получает
число i как аргумент и печатает i-ое последовательное приближение
золотого сечения.

i-ое приближения золотого сечения вычисляется как отношение (i+1)-го
числа Фибоначчи к i-му.

Числами Фибоначчи называется последовательность, первые два элемента
которой (нумерация с единицы) равны 1, а каждое из последующих чисел равно
 сумме двух предыдущих. Первые члены последовательности Фибоначчи таковы:


Таким образом первое приближение золотого сечения — 1/1, второе — 2/1,
третье — 3/2, четвертое — 5/3 и т. д.

Следите за правильностью названия функции.

Пример 1
Ввод	Вывод
golden_ratio(1)
1.0
Пример 2
Ввод	Вывод
golden_ratio(2)
2.0
Пример 3
Ввод	Вывод
golden_ratio(4)
1.6666666666666667

Примечания
Ваша функция ничего не должна читать из стандартного ввода.
Тестирующая система вызывает специальную программу, которая прочитает
входные данные и вызовет вашу функцию."""